cttodd88/stm32pwm/main.c
    //About button
    hButtonAbout = BUTTON_CreateEx(240, 0, 80, 50, hMenu, WM_CF_SHOW, 0, GUI_ID_BUTTON3);
    BUTTON_SetFont(hButtonAbout, &GUI_Font8x16);
    BUTTON_SetText(hButtonAbout, "About");
    BUTTON_SetFocussable(hButtonAbout, 0);
    
    BUTTON_SetDefaultSkin(BUTTON_SKIN_FLEX);
    //HOME SCREEN: Output button
    hButtOutput = BUTTON_CreateEx(180, 106, 116, 50, hScreen, WM_CF_HIDE | WM_CF_DISABLED, 0, GUI_ID_BUTTON4);
    BUTTON_SetFont(hButtOutput, GUI_FONT_20B_ASCII);
    BUTTON_SetText(hButtOutput, "OUTPUT");
    BUTTON_SetFocussable(hButtOutput, 0);
    
    //BATTERY SCREEN: Set Capacity
    hButtCapacity = BUTTON_CreateEx(20, 120, 120, 30, hScreen, WM_CF_HIDE | WM_CF_DISABLED, 0, GUI_ID_BUTTON5);
    BUTTON_SetFont(hButtCapacity, &GUI_Font8x16);
    BUTTON_SetText(hButtCapacity, "Set Capacity");
    BUTTON_SetFocussable(hButtCapacity, 0);
    
    hChargeBar = PROGBAR_CreateEx(215, 40, 50, 120, hScreen, WM_CF_HIDE, PROGBAR_CF_VERTICAL, GUI_ID_PROGBAR0);
    PROGBAR_SetBarColor(hChargeBar, 0, GUI_DARKGREEN);
    PROGBAR_SetBarColor(hChargeBar, 1, GUI_BLACK);    
    
    /*
     * Frame Window for user input of battery capacity
     */
    hFrame = FRAMEWIN_CreateEx(10, 10, 120, 125, hScreen, WM_CF_HIDE, 0, GUI_ID_FRAMEWIN0, 
            "Set Battery Capacity", cbWindow);
    
    hChild = WM_GetClientWindow(hFrame);
    WM_SetCallback((hChild), cbFrame);
    
    hSpin = SPINBOX_CreateEx(0,0, WM_GetWindowSizeX(hChild),
            50, hChild, WM_CF_SHOW, GUI_ID_SPINBOX0, 1, 200);
    SPINBOX_SetFont(hSpin, GUI_FONT_32B_ASCII);
    SPINBOX_SetValue(hSpin, batteryCap);
    
    hButtOK = BUTTON_CreateEx(20 - FRAMEWIN_GetBorderSize(hFrame), 60, 80, 40,
            hChild, WM_CF_SHOW, 0, GUI_ID_BUTTON6);
    BUTTON_SetFont(hButtOK, &GUI_Font8x16);
    BUTTON_SetText(hButtOK, "OK");
    BUTTON_SetFocussable(hButtOK, 0);
    
    GUI_Clear();
    
    WM_SelectWindow(hScreen); // set the main drawing window
    WM_SetFocus(hMenu); // give input focus to menu
    drawHomeScreen(); // default menu selection

    /*
     * Touch Calibration from TOUCH_sample.c
     */
    /*GUI_PID_STATE TouchState;
    int           xPhys;
    int           yPhys;

    //GUI_Init();
    GUI_CURSOR_Show();
    GUI_CURSOR_Select(&GUI_CursorCrossL);
    GUI_SetBkColor(GUI_WHITE);
    GUI_SetColor(GUI_BLACK);
    GUI_Clear();
    GUI_DispString("Measurement of\nA/D converter values");*/
    /*
     * END OF CALIBRATION CODE
     */
    
    while(1)
    {
        /*
         * Touch Calibration from TOUCH_sample.c
         */
        /*GUI_PID_GetCurrentState(&TouchState);  // Get the touch position in pixel
        xPhys = GUI_TOUCH_GetxPhys();     // Get the A/D mesurement result in x
        yPhys = GUI_TOUCH_GetyPhys();     // Get the A/D mesurement result in y
        //
        // Display the measurement result
        //
        GUI_SetColor(GUI_BLUE);
        GUI_DispStringAt("Analog input:\n", 0, 20);
        GUI_GotoY(GUI_GetDispPosY() + 2);
        GUI_DispString("x:");
        GUI_DispDec(xPhys, 4);
        GUI_DispString(", y:");
        GUI_DispDec(yPhys, 4);
        //
        // Display the according position
        //
        GUI_SetColor(GUI_RED);
        GUI_GotoY(GUI_GetDispPosY() + 4);
        GUI_DispString("\nPosition:\n");
        GUI_GotoY(GUI_GetDispPosY() + 2);
        GUI_DispString("x:");
        GUI_DispDec(TouchState.x,4);
        GUI_DispString(", y:");
        GUI_DispDec(TouchState.y,4);
        //
        // Wait a while
        //
        GUI_Delay(50);*/
        /*
         * END OF CALIBRATION CODE
         */
        
        // Debug Code
        /*
        GUI_PID_GetCurrentState(&pstate);

        GUI_SetFont(&GUI_Font8x16);
        
        if (pstate.Pressed) {
            GUI_DispDecAt( pstate.x, 280,20,4);
            GUI_DispDecAt( pstate.y, 280,40,4);
            GUI_DispStringAt("-P-", 280,60);
        }
        else {
            GUI_DispDecAt( 0, 280,20,4);
            GUI_DispDecAt( 0, 280,40,4);
            GUI_DispStringAt("- -", 280,60);
        }*/
        
        updateDispValues();

        GUI_Delay(50);
/*
    	while(duty<=8399){
    		PWM_InitOC4(duty);
    		duty++;
    		Delay(1);

    	}

    	while(duty>=0){
    		PWM_InitOC4(duty);
    		duty--;
    		Delay(1);
    	}
 */
/*

    	while(duty<=8399){

        if(state==0){

    	PWM_InitOC1(duty);

        }
        else if(state==1){

        	PWM_InitOC2(duty);
        }
        else if(state==2){

        	PWM_InitOC3(duty);
        }
        else if(state==3){

        	PWM_InitOC4(duty);
        }
        else{

        	state=0;
        }

    	duty++;
    	Delay(120);

    	}

    	while(duty>=0){

        if(state==0){

        	PWM_InitOC1(duty);

        }
        else if(state==1){

        	PWM_InitOC2(duty);

        }
        else if(state==2){

        	PWM_InitOC3(duty);

        }
        else if(state==3){

        	PWM_InitOC4(duty);

        }

        else{

        	state=0;

        }

    	duty--;
    	Delay(120);

    	}

    	state++;

    	if(state==4){

    		state=0;
    	}

    	Delay(250000);
*/        
    }//END WHILE





}


void Delay(unsigned int nTime)
{

	 TimingDelay=nTime;
	 while(TimingDelay!=0);


}

/*The systick handler in stm32f4xx_it.c calls this function and
 *decrements the TimingDelay variable every millisecond */

// Conflict with display functions, confirmed unused - Taylor
/*
void TimingDelay_Decrement(void){
if(TimingDelay!=0x00){

TimingDelay--;
}

}

void SysTick_Handler(void) {
	TimingDelay_Decrement();
}
*/
void TIM3_IRQHandler(void){



	 if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
	    {
	        TIM_ClearITPendingBit(TIM3, TIM_IT_Update);


	if(index2<=50){

	PWMTIM3_InitOC4(lookup[index2]);

	}

	if(index2>=50){

	PWMTIM3_InitOC3(lookup[index2]);

	}



	index2++;

	if(index2==101){

		index2=0;
	}

/*
	PWM_InitOC4(duty);

	if((duty<=period)&&(state==0)){

		if(duty!=period){
		duty++;
		}
		else{
		state=1;
		}
	}


	if((duty<=period)&&(state==1)){

		if(duty!=0){
		duty--;
		}
		else{
		state=0;
		}
	}


*/

