cttodd88/stm32pwm/main.c
  }
}

/*
 * getMeasurement()
 * Will get information from sensors and other measurements
 */
SENSORS getMeasurement(void) {
    SENSORS measured;
    measured.inVoltage = 30.2;
    measured.inCurrent = 1.34;
    measured.inPower = 40.468;
    measured.outVoltage = 119.98;
    measured.outCurrent = 2.8;
    measured.outPower = 335.944;
    measured.outFreq = 59.97;
    measured.temp1 = 52.43;
    measured.temp2 = 59.87;
    
    return measured;
}
/*
 * getBattMeas()
 * Contains the battery information from sensors
 */
BATTINFO getBattMeas(void) {
    BATTINFO meas;
    meas.voltage = 24;
    meas.current = 0.5;
    meas.state = 1;
    meas.chargeLevel = 72;
    
    return meas;
}

/*Window Callback Override*/
void cbWindow(WM_MESSAGE * pMsg) {
    int NCode;
    int Id;
    // USER START (Optionally insert additional variables)
    // USER END

    switch (pMsg->MsgId) {
        case WM_NOTIFY_PARENT:
            Id    = WM_GetId(pMsg->hWinSrc);
            NCode = pMsg->Data.v;
            switch(Id) {
                case GUI_ID_BUTTON0: // Notifications sent by 'Home Button'
                    switch(NCode) {
                        case WM_NOTIFICATION_CLICKED:
                            //GUI_Clear();
                            //GUI_DispStringAt("HOME", 0 , 100);
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            if(currentScreen) {
                                currentScreen = 0;
                                drawHomeScreen();
                            }                            
                            break;
                    }
                    break;
                case GUI_ID_BUTTON1: // Notifications sent by 'Battery Button'
                    switch(NCode) {
                        case WM_NOTIFICATION_CLICKED:
                            //GUI_Clear();
                            //GUI_DispStringAt("BATTERY", 0, 100);
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            if(!(currentScreen == 1)) {
                                currentScreen = 1;
                                drawBattScreen();
                            }
                            break;
                    }
                    break;
                case GUI_ID_BUTTON2: // Notifications sent by 'System Button'
                    switch(NCode) {
                        case WM_NOTIFICATION_CLICKED:
                            //GUI_Clear();
                            //GUI_DispStringAt("SYSTEM", 0, 100);
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            if(!(currentScreen == 2)) {
                                currentScreen = 2;
                                drawSysScreen();
                            }
                            break;
                    }
                    break;
                case GUI_ID_BUTTON3: // Notifications sent by 'About Button'
                    switch(NCode) {
                        case WM_NOTIFICATION_CLICKED:
                            //GUI_Clear();
                            //GUI_DispStringAt("ABOUT", 0, 100);
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            if(!(currentScreen == 3)){
                                currentScreen = 3;
                                drawAboutScreen();
                            }
                            break;
                    }
                    break;
                case GUI_ID_BUTTON4: // Notifications sent by 'HOME:Output Button'
                    switch(NCode) {
                        case WM_NOTIFICATION_RELEASED:
                            homeStatusFlg ^= ONFLAG;
                            break;
                    }
                    break;
                case GUI_ID_BUTTON5: // Notifications sent by 'BATT: Set Battery Capacity'
                    switch(NCode) {
                        case WM_NOTIFICATION_RELEASED:
                            drawBatteryCapacity();
                            break;
                    }
                    break;
            }
            break;

        default:
            WM_DefaultProc(pMsg);
            break;
    }
}

/*Frame Callback Override*/
void cbFrame(WM_MESSAGE * pMsg) {
    int Id;
    int NCode;
    
    switch (pMsg->MsgId) {
        case WM_PAINT:
            GUI_SetBkColor(0xc0c0c0); // default frame color from API document
            GUI_Clear();
            break;
        case WM_NOTIFY_PARENT:
            Id    = WM_GetId(pMsg->hWinSrc);
            NCode = pMsg->Data.v;
            switch(Id) {
                case GUI_ID_BUTTON6:
                        switch(NCode) {
                            case WM_NOTIFICATION_RELEASED:
                                setBatteryCapacity();
                                break;
                        }
                        break;
            }
            break;
        default:
            WM_DefaultProc(pMsg);
  }
}
/*
 * GUI SCREEN DRAWING FUNCTIONS
 * ============================
 */

/*
 * drawHomeScreen()
 */
void drawHomeScreen(void) {   
    WM_SelectWindow(hScreen);
    WM_ShowWindow(hButtOutput);
    WM_EnableWindow(hButtOutput);
    WM_HideWindow(hButtCapacity);
    WM_DisableWindow(hButtCapacity);
    WM_HideWindow(hChargeBar);
    WM_HideWindow(hFrame);
    
    GUI_Clear();
        
    // indicator BG circles
    GUI_SetColor(GUI_BLACK);
    GUI_FillCircle(20,24,16); // DC Input
    GUI_FillCircle(20,66,16); // Battery
    GUI_FillCircle(20,108,16); // Temperature
    GUI_FillCircle(20,150,16); // Existing Out
    GUI_FillCircle(283,40,32); // On
    GUI_FillCircle(192,40,32); // Off
    
    updateDispValues(); // display current status indicators 
    
    GUI_SetColor(GUI_CYAN);
    GUI_SetFont(&GUI_Font8x16);
    GUI_DispStringAt("DC Input", 44, 16);
    GUI_DispStringAt("Battery", 44, 58);
    GUI_DispStringAt("Temperature", 44, 100);
    GUI_DispStringAt("Existing Out", 44, 142);
    GUI_DispStringAt("ON", 276, 76);
    GUI_DispStringAt("OFF", 181, 76);
    
